<?php

return [
    'driver' => ['driver' => 'gd'],
    'posts_per_page' => 5,
    'upload' => [
        'storage' => 'upload',
        'webpath' => 'uploads',
    ],
    'userpic' => 'uploads/userpic',
    'studentFile' => 'uploads/student',
    'province' => [
        '110000' => '北京市',
        '120000' => '天津市',
        '130000' => '河北省',
        '140000' => '山西省',
        '150000' => '内蒙古自治区',
        '210000' => '辽宁省',
        '220000' => '吉林省',
        '230000' => '黑龙江省',
        '310000' => '上海市',
        '320000' => '江苏省',
        '330000' => '浙江省',
        '340000' => '安徽省',
        '350000' => '福建省',
        '360000' => '江西省',
        '370000' => '山东省',
        '410000' => '河南省',
        '420000' => '湖北省',
        '430000' => '湖南省',
        '440000' => '广东省',
        '450000' => '广西壮族自治区',
        '460000' => '海南省',
        '500000' => '重庆市',
        '510000' => '四川省',
        '520000' => '贵州省',
        '530000' => '云南省',
        '540000' => '西藏自治区',
        '610000' => '陕西省',
        '620000' => '甘肃省',
        '630000' => '青海省',
        '640000' => '宁夏回族自治区',
        '650000' => '新疆维吾尔自治区',
        '710000' => '台湾省',
        '810000' => '香港特别行政区',
        '820000' => '澳门特别行政区',
    ],
    'politics' => [
        '0' => '群众',
        '1' => '团员',
        '2' => '预备党员',
        '3' => '党员',
    ],
    'academy' => [
        '1000' => [
            'name' => '环境科学与工程学院',
            'profession' => [
                '1010' => '环境科学与工程类',
                '1011' => '给排水科学与工程',
                '1012' => '地理信息科学',
                '1013' => '人文地理与城乡规划',
                '1014' => '测绘工程',
                '1015' => '建筑环境与能源应用工程',
            ]
        ],
        '1100' => [
            'name' => '电子与信息工程学院',
            'profession' => [
                '1110' => '电子信息工程',
                '1111' => '计算机科学与技术',
                '1112' => '计算机科学与技术（嵌入式培养）',
                '1113' => '电气工程及其自动化',
                '1114' => '建筑电气与智能化',
                '1115' => '通信工程',
                '1116' => '通信工程（嵌入式培养）',
            ]
        ],
        '1200' => [
            'name' => '商学院',
            'profession' => [
                '1210' => '工商管理',
                '1211' => '市场营销',
                '1212' => '旅游管理',
                '1213' => '金融工程',
                '1214' => '物流管理',
            ]
        ],
        '1300' => [
            'name' => '人文学院',
            'profession' => [
                '1310' => '汉语言文学（师范）',
                '1311' => '汉语言文学',
                '1312' => '广播电视学',
                '1313' => '历史学（师范）',
                '1314' => '社会工作',
                '1315' => '汉语国际教育',
            ]
        ],
        '1400' => [
            'name' => '数理学院',
            'profession' => [
                '1410' => '数学与应用数学（师范）',
                '1411' => '信息与计算科学',
                '1412' => '物理学（师范）',
                '1413' => '应用物理学',
            ]
        ],
        '1500' => [
            'name' => '化学生物与材料工程学院',
            'profession' => [
                '1510' => '化学（师范）',
                '1511' => '应用化学',
                '1512' => '材料化学',
                '1513' => '生物工程',
                '1514' => '生物技术',
                '1515' => '功能材料',
            ]
        ],
        '1600' => [
            'name' => '外国语学院',
            'profession' => [
                '1610' => '化学（师范）',
                '1611' => '应用化学',
                '1612' => '材料化学',
                '1613' => '生物工程',
                '1614' => '生物技术',
                '1615' => '功能材料',
            ]
        ],
        '1700' => [
            'name' => '音乐学院',
            'profession' => [
                '1710' => '音乐学（师范）',
            ]
        ],
        '1800' => [
            'name' => '国际教育学院',
            'profession' => [
                '1810' => '管理科学与工程类（工程管理）',
                '1811' => '物流管理与工程类（物流管理）',
                '1812' => '机械类（机械设计制造及其自动化）',
                '1813' => '土木类（土木工程）',
            ]
        ],
    ],
];
